Revit 2026 API

# ApplicationGetLibraryPaths Method

---

Returns path information identifying where Revit searches for content.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IDictionary<string, string> GetLibraryPaths()
```
```vb
Public Function GetLibraryPaths As IDictionary(Of String, String)
```
```cpp
public:
IDictionary<String^, String^>^ GetLibraryPaths()
```
```fsharp
member GetLibraryPaths : unit -> IDictionary<string, string>
```

#### Return Value

IDictionaryString, String The map of library paths.

The map that is returned contains a key that is purpose of the path, such as Material Libraries and the value in the map is the fully qualified path that is used for that search path.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace